
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.hmc-hearing-management-db.azurerm_postgresql_server.replica[&#34;replica01&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hmc-hearing-management-db.azurerm_postgresql_server.replica["replica01"] must be replaced
-/+ resource "azurerm_postgresql_server" "replica" {
        administrator_login               = "hmc"
        administrator_login_password      = (sensitive value)
      ~ auto_grow_enabled                 = true -> (known after apply)
        backup_retention_days             = 35
        create_mode                       = "Replica"
        creation_source_server_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-cft-hearing-service-postgres-db-data-aat/providers/Microsoft.DBforPostgreSQL/servers/hmc-cft-hearing-service-postgres-db-aat"
      ~ fqdn                              = "hmc-cft-hearing-service-postgres-db-aat-replica01.postgres.database.azure.com" -> (known after apply)
      ~ geo_redundant_backup_enabled      = true -> false
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-cft-hearing-service-postgres-db-data-aat/providers/Microsoft.DBforPostgreSQL/servers/hmc-cft-hearing-service-postgres-db-aat-replica01" -> (known after apply)
      - infrastructure_encryption_enabled = false -> null
        location                          = "uksouth"
        name                              = "hmc-cft-hearing-service-postgres-db-aat-replica01"
        public_network_access_enabled     = true
        resource_group_name               = "hmc-cft-hearing-service-postgres-db-data-aat"
        sku_name                          = "GP_Gen5_2"
      ~ ssl_enforcement                   = "Enabled" -> (known after apply)
        ssl_enforcement_enabled           = true
      ~ ssl_minimal_tls_version_enforced  = "TLSEnforcementDisabled" -> "TLS1_2"
        storage_mb                        = 51200
        tags                              = {
            "BuiltFrom"           = "https://github.com/HMCTS/hmc-cft-hearing-service.git"
            "application"         = "core-case-data"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
        version                           = "11"

      ~ storage_profile {
          ~ auto_grow             = "Enabled" -> (known after apply)
          ~ backup_retention_days = 35 -> (known after apply)
          ~ geo_redundant_backup  = "Enabled" -> (known after apply)
          ~ storage_mb            = 51200 -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":307,"Program":"tfcmt","SHA1":"","Vars":{}} -->